projects/btech.org
#+title: B.Tech Projects
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />
#+OPTIONS: html-style:nil toc:nil title:nil num:nil timestamp:nil

#+begin_export html
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a href="../research-topics/index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a class="active" href="./index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>
#+end_export

#+INCLUDE: ../logo.org

* Two Wheel Self Balancing Robot
- B.Tech Final Year
- Team Size: 6
- Implemented on: ATMEGA 2560
  PID control algorithm was used to drive 4 channel DC motor using L298MD motor driver, with input fed from MPU 6050 gyroscope to keep a robot upright on 2 wheels.
* Plant Self Care System
- B.Tech Prefinal Semester
- Team Size: 6
- Implemented on: Arduino
DHT and pH sensor was used to fed data about the moisture and pH of soil to Arduino, which in turn control flow of water to plants in drip irrigation system.
* Pizza Delivery System
- B.Tech 3rd Year
- Team Size: 4
- Implemented on: AVR
Implemented a line follower equipped with proximity and colour sensor, which will correctly identify required colour (flavour) and size of box and deliver it to correct location.
* Gesture Controlled Wheelchair
- B.Tech 2nd Year
- Team Size: 10
Implemented a circuit in which a gyroscope, whose orientation was control by human subject, was used to control motors attached to a wheelchair.
* Home Security Alarm
- B.Tech 1st Year
- Team Size: 4
Simple circuit based on Transistor switch was implemented using LDR, in which buzzer beeps every time the light falling on LDR was obsecured.
