docs/projects/btech.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>B.Tech Projects</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a href="../research-topics/_index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a class="active" href="./_index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-org2abfc85" class="outline-2">
<h2 id="org2abfc85">Two Wheel Self Balancing Robot</h2>
<div class="outline-text-2" id="text-org2abfc85">
<ul class="org-ul">
<li>B.Tech Final Year</li>
<li>Team Size: 6</li>
<li>Implemented on: ATMEGA 2560
PID control algorithm was used to drive 4 channel DC motor using L298MD motor driver, with input fed from MPU 6050 gyroscope to keep a robot upright on 2 wheels.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfa07beb" class="outline-2">
<h2 id="orgfa07beb">Plant Self Care System</h2>
<div class="outline-text-2" id="text-orgfa07beb">
<ul class="org-ul">
<li>B.Tech Prefinal Semester</li>
<li>Team Size: 6</li>
<li>Implemented on: Arduino</li>
</ul>
<p>
DHT and pH sensor was used to fed data about the moisture and pH of soil to Arduino, which in turn control flow of water to plants in drip irrigation system.
</p>
</div>
</div>
<div id="outline-container-org5f31c4f" class="outline-2">
<h2 id="org5f31c4f">Pizza Delivery System</h2>
<div class="outline-text-2" id="text-org5f31c4f">
<ul class="org-ul">
<li>B.Tech 3rd Year</li>
<li>Team Size: 4</li>
<li>Implemented on: AVR</li>
</ul>
<p>
Implemented a line follower equipped with proximity and colour sensor, which will correctly identify required colour (flavour) and size of box and deliver it to correct location.
</p>
</div>
</div>
<div id="outline-container-org411b9c5" class="outline-2">
<h2 id="org411b9c5">Gesture Controlled Wheelchair</h2>
<div class="outline-text-2" id="text-org411b9c5">
<ul class="org-ul">
<li>B.Tech 2nd Year</li>
<li>Team Size: 10</li>
</ul>
<p>
Implemented a circuit in which a gyroscope, whose orientation was control by human subject, was used to control motors attached to a wheelchair.
</p>
</div>
</div>
<div id="outline-container-org8668ebb" class="outline-2">
<h2 id="org8668ebb">Home Security Alarm</h2>
<div class="outline-text-2" id="text-org8668ebb">
<ul class="org-ul">
<li>B.Tech 1st Year</li>
<li>Team Size: 4</li>
</ul>
<p>
Simple circuit based on Transistor switch was implemented using LDR, in which buzzer beeps every time the light falling on LDR was obsecured.
</p>
</div>
</div>
</div>
</body>
</html>
